#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ .
Ġ (
Ġ )
Ġ ;
e r
i n
o n
a t
e t
Ġ ,
s t
i c
Ġ p
o r
e n
a l
Ġ {
Ġ }
a n
Ġ i
l e
Ġ c
Ġ =
t i
Ġ m
r e
t e
r o
i d
u b
Ġ n
s s
Ġ f
l ic
Ġ g
Ġ s
Ġ in
S t
Ġ "
a r
ub lic
c e
in g
Ġp ublic
Ġ t
m p
Ġg et
u r
I n
at e
en t
Ġ a
ti on
e w
Ġin t
e c
a g
r i
u l
or t
Ġ v
i t
Ġ r
Ġ b
Ġ st
i on
an d
a c
u t
Ġi mp
m e
d e
Ġimp ort
ur n
et urn
u n
s e
r ing
Ġ e
l a
Ġr eturn
Ġn ew
u e
St ring
Ġ C
Ġ 0
E x
Ġ <
Ġ T
R e
Ġst at
e d
Ġf in
o c
p tion
i l
Ġstat ic
x t
at ion
Ġ S
Ġ @
i st
Ġfin al
o id
Ġ l
Ġ A
Ġv oid
ul l
o m
er t
Ġi f
Ġ +
Ġt h
r a
ag e
Ġ re
ro id
Ġ String
b le
and roid
C on
o o
ri v
Ġ android
ce ption
riv ate
i s
ac k
v er
Ġ d
Ġp rivate
Ex ception
a d
e l
Ġ j
t er
e st
Ġ 1
ss ert
Ġ >
Ġ O
a p
c h
Ġ o
p p
Ġs et
Ġa ssert
0 0
Ġ [
a v
Ġ M
Ġn ull
Ġ ]
L ist
a me
Ġ R
i g
la ss
a ble
p e
q u
o de
o l
Ġ P
ro w
Ġ B
a m
m ent
Ġ I
oc k
te d
en d
y pe
Ġc on
O N
Ġ u
Ġ te
Ġc om
o t
ic e
y te
Ġ w
av a
al l
al ue
Ġ D
i le
i ew
Ġth row
a s
v ice
I d
ec t
d er
Ġt r
E R
In t
Ġj ava
id e
i z
ti l
Ġi s
s er
qu al
t h
e y
Ġ L
it y
e ss
o g
Ġ N
f f
o un
Ġ !
ul t
o w
at a
N ame
te xt
le an
Ġte st
Ġc lass
r ide
i f
Ġ h
f o
ver ride
d d
qual s
Ġ F
D e
an ag
oo lean
A T
u m
ĠO verride
u p
anag er
V iew
E n
ra y
u il
M anager
o d
Re s
ack age
T ype
I N
P ro
a se
v e
Ġb yte
C h
A c
l o
Ġb oolean
S T
T o
Ġ U
In fo
Ġ= =
T est
Ġ 2
l er
Ġ :
p ut
j ect
an g
u re
Ġ -
R E
Ġp ro
o mp
Ġf or
at ch
Ġ de
en er
al se
Ġre s
et h
St ate
on g
r ray
Ġ or
e xt
Ġ E
K ey
el d
ac t
iz e
Ġt o
i eld
V alue
Ġa dd
Ġ In
E quals
Con t
f a
S et
A G
ess age
le c
ĠT est
Ġc h
Ġe x
Ġ! =
b ject
in t
P ar
en ce
Ġu til
i me
oun t
Ġth is
Ġassert Equals
E N
uil der
F or
e s
Ġor g
r y
er s
ar g
er vice
Ġ on
Ġthrow s
A L
T r
Ġf alse
la y
i m
Ġa pp
u s
ĠC on
at or
it h
ti me
T I
O R
H and
an n
f ig
T h
st an
Ġtr ue
re am
o ur
L E
ti v
p ec
Ġcon t
D ata
e m
f er
C all
en g
v ent
ar t
de x
P o
tiv ity
P re
g er
our ce
ti f
le ment
A l
A n
Ġ V
Ġp ar
eng th
I D
Ġv alue
fer ence
T ime
or e
re ate
i r
a in
s c
Ġp ackage
A N
st r
M E
Ġ &
at h
ce ss
ro l
Ġl ong
a k
Ġ k
S ervice
if i
Ġ 3
St ream
s et
b ack
eth od
List ener
Ġe l
D E
Ġel se
ec k
p er
Ġe xt
re ss
q ue
o ut
a y
t or
A C
u te
N ull
l y
Ġres ult
or k
l i
y st
Ġo ut
A R
ĠR un
u ff
yst em
on e
M ap
Con text
ad er
i tion
E D
ing s
u pp
m at
u ment
U n
Ġ G
m and
an s
Ġtr y
m o
Ġa c
in d
ot ation
St at
lo at
S I
Ġs h
Ġ W
t t
Ġc reate
p h
U til
Ġ H
ĠA rray
in e
Hand ler
que st
te ger
a il
stan ce
F ile
oc al
ur r
uff er
ĠO bject
Int ent
T Y
De vice
Con fig
S e
Ġ List
S c
fa ce
Ġ< /
M essage
i o
č Ċ
A rray
Ġl ength
ac h
Ġ 4
r or
C E
v id
te m
ĠL og
tif ic
Ġf ield
Par am
C lass
Ġk ey
u c
Ġ ?
Ġc ase
ro m
or y
Ġc atch
sc ri
pec ted
Ġ& &
P E
i al
E vent
a st
t y
o p
A pp
Ġ |
S E
h t
Ġp ut
end s
b er
un d
la ble
g le
up er
i ve
ess ion
te c
urr ent
C omp
is p
T ext
Ġ Exception
ar d
W ith
M ode
y n
S h
Ġext ends
vid er
ĠT AG
Ġapp end
tec ted
Cont rol
ig n
u le
C ount
00 00
O U
o s
O n
Ġs uper
Ġcon text
Ġpro tected
Res ult
re c
B uilder
or d
S ize
U ser
fa ult
Ac tivity
Ġ Re
r g
oc ation
In dex
t ings
n ec
et w
Ġ+ +
Ġint er
Ġh as
en s
m i
oo gle
Ġs ize
r int
time Exception
lec tion
etw ork
Tr ue
oun d
arg et
p d
Ġn ame
Ġ x
F ield
t s
i a
Ġst art
um ber
ri te
O ut
Ġ 5
re ad
A A
IN G
al id
Ġ 6
En t
P er
P ackage
C ode
Ġg oogle
a b
Ġw h
t o
ĠRun timeException
St ub
T E
H e
R I
Ġcont ent
isp lay
a re
S S
er if
B yte
Ġm C
Ch ang
uil d
EN T
Ġi o
Call back
AT E
O f
ri b
Ġm ock
i b
Ġi d
a x
TI ON
Ġm essage
ur ation
le g
Ġ *
n al
Ġd ata
un it
il ter
pd ate
In ter
put Stream
li ent
ow n
Ġ en
om mand
Ġp re
Control ler
Ġd o
N ot
Al l
ed ia
l ock
ro up
Ġl ang
Ġ arg
ig ht
tific ation
Ġ ann
K E
ĠIn teger
Ġassert True
! "
F I
mp le
O Exception
Ent ry
l u
Pre ference
Ġ an
Ġex pected
erif y
Ġch eck
o tification
Ġe quals
on ent
ĠCon text
L O
In stance
ff set
ann el
ra w
Ġ View
Th at
ar y
R O
Ġann otation
O bject
Util s
Ġto String
A rg
ĠI OException
C ol
L og
or ted
Ġc omp
Ġr un
m s
Ġm M
Ġv iew
Ġt ype
rib ute
ĠA c
L I
R ec
r ic
mi ss
ate d
Ġ J
ub le
B uffer
ĠF ile
Ġm eth
Ġassert That
s h
m on
i p
M ethod
Ġstatic Int
Ġfield Int
T H
i ti
L ock
I tem
as k
Ex t
A d
r ag
at ure
il d
re ak
Ġv erify
iz ed
Ġj unit
A dd
ĠC ol
AT I
i x
able d
Ġm S
Ġf loat
at ive
Ġget S
c on
Ġw rite
V I
C O
und le
A B
Ġc all
U L
r ror
For mat
u g
or m
g ist
An d
Ġp rint
il ity
il l
Re quest
Ġ '
1 2
T ag
A D
Ġl ist
ind ow
ĠC h
act ory
C H
nec tion
n er
p t
Ġ| |
E ST
D ec
A ME
Ġu ser
C ON
Ġb reak
A P
on Null
Ġ time
i ble
ay out
o st
ĠS et
m ap
Ġ ar
er ver
miss ion
Ġre ad
l ag
Res ource
Cont ent
ce l
R un
lec t
u d
F rom
Ġin dex
KE Y
i te
Pro vider
Stat us
Ġ Intent
rag ment
B y
A tt
Ġl og
Ġis E
de d
Ġ at
D I
o f
as h
Tr ans
Param et
E lement
mp ty
ĠArray List
Ġ X
1 6
N umber
O r
3 2
id th
r on
f ile
Ġs e
Ġ 8
P ath
mo ve
scri ption
t on
ach e
1 0
it o
Ġm Context
upp orted
ut ton
ĠU n
C ap
Ġc ol
ud io
ATI ON
g et
Po s
o ul
p c
oul d
l et
p ort
ĠI N
E rror
F F
G roup
ĠS ystem
k en
ĠD E
00 0
ĠD e
Hand le
Ġs c
T R
Ġcom mon
Ġ un
ĠP ro
Ġ ent
te st
Ġo s
S ER
str act
AG E
raw able
St art
ak e
b stract
Ġb uild
c ount
se d
ocal e
Ac tion
TY PE
I L
ĠP ar
Ġs ub
c y
R eturn
Ġa s
leg al
Ġ la
m m
2 0
Ġar ray
l legal
N etwork
F actory
U N
ĠM ock
u f
Ġo f
S pec
m l
h one
C ommand
ap ter
Ġte xt
Ġ 7
L e
ti ve
Ġcont ain
m age
M P
ĠT h
1 1
at ter
Arg ument
5 6
Ġpar am
p on
l n
A Y
ĠN onNull
9 9
u st
Byte s
ĠB uilder
E T
A S
ut able
Ġb uilder
re d
lag s
oo th
Ex p
mp l
M et
Ġst ring
ib ility
N ode
Ġu pdate
ang e
Add ress
ra me
Ġ ro
V is
ul lable
F A
et ooth
lu etooth
lic y
Ġm B
v el
ĠI llegal
Ġo b
f t
ul ti
S ession
un ch
ir st
Ġin put
Ġ er
str uc
u al
H el
P a
f orm
5 0
ock et
T ER
Ġinter nal
Ġe vent
ur s
N AME
p s
Ġf ail
Ġ1 0
i rec
ce i
En abled
. "
Ġm D
Res ol
mo te
ption s
Ġs ec
ĠC lass
C TION
Ġch ar
Ġp os
Ġint ent
in k
Chang ed
Ġf ile
pon se
S p
Ġre move
lement s
Ġ y
a mple
U s
Ġfor mat
Con nection
Ġ ic
ĠB yte
am er
s g
b o
Th read
Ġcon fig
ens ion
Ġn ext
Value s
ur ity
Ġs yn
amer a
ĠA n
e ature
F ilter
De fault
ĠM ap
6 4
Ġm W
N O
V AL
ter ator
ial og
U T
ut h
Ġh e
p tor
k e
it map
ĠS T
U M
Ġ Key
Un it
ser ver
A t
I s
it ch
C T
Ġfin d
Ġat t
urs or
S ub
Stat s
In put
F alse
ĠCon t
Ġwh en
ĠT EST
lic ation
AC K
An im
AB LE
Ġan y
it or
Ġpar se
M O
ĠN ullable
Ġn ot
Ġcom mand
Ġm L
ĠC omp
S ource
ĠCol lection
3 4
ch ron
Ġb e
Ġm R
Ġarg s
Ġm ax
Ġget C
w itch
Param s
Rec ord
Ġh and
ra m
Ġandroid x
Ġre quest
Ġcontain s
UL T
v alid
t ure
ĠA ssert
Ġent ry
qu i
Att ribute
U E
S H
Ad apter
e e
ers ion
Ġm P
Ġf rom
Ġ 9
\ "
re en
Hel per
a it
ri ter
um n
c ast
O L
ol der
Ġ z
Ġprint ln
in der
lic k
Ġc urrent
mm utable
SI ON
id get
Ġst ate
c ode
O ffset
C ase
Ġde fault
L ong
Ġin fo
Ch annel
re e
v ed
D isplay
Ch ar
Po licy
L ayout
o ad
Ġt arget
p ly
3 0
y le
Per mission
Ġ al
on d
ĠT ext
T arget
in ter
5 5
Config uration
p i
Ac cess
lo se
Ġde vice
s n
o b
N E
el l
F ragment
2 4
th er
Ġs ession
Ġ- >
on y
T ask
le ar
ile d
ĠA l
gist er
V E
ĠT ype
Re cei
Ġ" "
Comp onent
A s
Ġdo uble
N o
a i
op y
Ġn et
u me
Pos ition
ĠU ser
le ph
scri ptor
1 4
chron ized
p en
ĠR E
B utton
Ġ K
le d
Ġc ount
leph ony
Ġ end
ĠB undle
Ġm ethod
U ri
a w
Ġin stance
oo l
Id en
ert y
ĠArray s
L ength
Ġp er
g or
l d
p erty
U p
I T
Ġex p
Ġd ec
er y
Ch eck
OR T
A X
B ar
ti ty
Ġc an
ON E
8 0
Ġsh ort
Ġtr ans
ac tion
Ġm ap
iti al
o uble
ĠAc tivity
Ġ ur
end ing
TI ME
Con stan
Ġm sg
Ch ild
Ġsyn chronized
Ġassert False
lo ad
Pro file
a iled
Ex ec
ar i
Z E
W indow
ĠCh ar
ĠI mmutable
n otation
e ar
ĠM edia
Ġs ource
U S
Ġs end
In teger
1 7
C lient
N otification
M ock
Argument Exception
qu ence
F loat
R ule
V ER
a ce
ĠA pp
un c
Ġpro to
Ġt ag
AL L
er ial
N ext
ĠH ash
Ġs p
5 4
ĠW ifi
OU N
= "
ur face
Ġimp lements
atter n
is h
Ġer ror
B ack
M atch
C lick
ri g
v ai
Par ser
e x
yn c
U P
f l
2 2
Chang e
VI CE
B lock
ĠT ime
qual To
oo t
ĠD ata
p ar
D own
1 9
W idth
Ġget Name
Col or
S ec
C reate
ill is
Set tings
m ary
3 3
Ġvalue s
I mpl
S ystem
Inter face
ĠIllegal ArgumentException
i mple
u se
ra ph
Ġs ervice
G et
Ġo ffset
v ocation
Paramet er
Ġo ther
Ġa bstract
an ce
En d
M S
Ġ+ =
Ġinter face
B U
8 8
F eature
Ġm in
ĠE X
an t
ĠP ackage
end er
Ġ le
Ġhas h
FA ULT
Ġ /
St r
Ġset tings
en u
Ġc lear
Ġout put
Ġ KEY
gor ith
ĠS h
He ight
U R
Recei ver
f ore
St ack
Q U
E X
Ġm T
Ġ all
Ġn ode
Ġlist ener
Resol ver
O W
Ġc lient
S C
Not Null
V ersion
Ġmock ito
s upported
Res ponse
Ġa d
De scriptor
ar n
AN D
ric s
ic s
er tific
ertific ate
ĠisE qualTo
Ġget String
SE T
ut o
U pdate
I S
Ġob j
v o
B ound
ac ter
Ġsh ould
gorith m
Or der
Ġi tem
o ader
ut ure
ign ed
Q L
Se lec
ut or
Ġde st
Ġv is
u ite
ĠT Y
ro und
3 6
vai lable
Ġ> =
T O
Ġpackage Name
D ate
Q u
F rame
OU T
ĠTY PE
Po int
Ġparam s
Resource s
ĠB ig
Ġget M
ĠmM ock
Ġs erver
v al
oo k
t ual
ĠC ON
Ġinstance of
En c
ug g
Ġm atch
ĠS upp
ĠU ri
U id
Ext ra
unc tion
Ġn o
VAL UE
Ġic u
n ame
M illis
en cy
Ġch ild
Us age
c om
S ocket
l it
F lags
D is
ri pt
Ġsec urity
Ġc lose
Paramet ers
ifi er
L AG
Ġp w
Tr ack
t om
O b
l ine
1 8
Ġb uffer
Ġwh ile
al end
U RE
f ix
alend ar
Ġb ase
T able
ĠN otification
4 0
Re ader
Ġ Z
To ken
ar k
3 7
tt p
Ġw ith
5 7
g round
ĠisE mpty
ad d
m in
Ġuser Id
Ġth en
I con
3 8
u ch
Re ad
Ġa p
ĠB luetooth
g e
Ġ1 2
c urrent
od ule
Ġget L
lay er
Name s
oc ument
u mp
Se quence
n ect
Out putStream
SI ZE
ad ata
lo b
ĠSet tings
Cont act
let e
P RO
ĠRe mote
Sh ort
Ġf ilter
Ġ _
f ter
AT A
Ġex ec
Ġget B
ĠS ec
A udio
ad ow
C K
CO DE
al e
00 1
Ġn ative
Ac count
2 9
t ing
St ore
S ign
ĠT r
ra ce
ide o
O M
In putStream
He ader
ow er
Ġhand le
v iew
ic al
Ġth e
av e
I mage
W riter
Ġm ode
Ġre c
tif i
pp er
Ġpos ition
Ġg r
rol l
W arn
Re gist
Out put
S P
oc us
Ġ %
St yle
H al
ĠUn supported
ĠT e
Ġn um
Ġget P
Ġs b
Ġ2 0
ĠR et
r act
s ent
ĠP re
Q ue
Ġstat us
y c
n able
en tion
Ġthen Return
o ver
An notation
Ġd isplay
o der
TR A
struc tion
MO DE
ĠMock ito
ĠC ommand
G ener
D ialog
Constan ts
S erver
O ptions
ĠR ec
Pro perty
D rawable
ĠL ong
ch ed
Ġst ream
ĠM ethod
ĠA CTION
Ġpro vider
Ġcall back
Col umn
3 9
e fore
Ġl oad
iti es
Ġ" ,
ĠL O
Ġur i
F irst
Ġget Instance
and om
ĠA S
a mp
leg ate
Sc reen
Ġch annel
w are
Ġc ore
Ġac tivity
im it
6 0
v ert
Ġac tion
in al
1 5
s p
r c
S ON
Ġpar ent
7 0
Ġp ath
qui re
row able
ACK AGE
Que ue
upp ort
uc cess
Ġla st
Dec l
Ġre f
Ġs witch
Ext ension
P ER
D et
o int
are d
ro ad
V alid
ĠRet ention
road cast
l og
H older
ĠCont ent
D irec
AA AA
ĠC all
En um
Lock ed
Ġen code
Type s
x y
ti es
ĠA sn
4 4
D ir
m b
ab el
Anim ation
ic k
Ġc opy
L AY
i ent
it s
ari able
ĠO n
ĠM essage
at er
A M
iz er
ST ATE
e as
C ache
or age
de f
ĠSupp ress
str ument
per ation
Ġ qu
Ġjava x
7 8
Re ference
Ġw idget
E L
Le vel
b ase
p rec
- -
ect or
eas ure
5 9
H ost
Ġc ode
k g
Ġc ar
U i
tif y
c ut
Ġb uf
Warn ings
In d
Pro g
B ase
2 6
M ulti
et er
) "
F ailed
Exec utor
Ġget Value
F ound
Ġe q
ĠTh rowable
ĠAS N
ĠM ath
per ties
Ġ" \
t ype
ĠAl l
ST R
L oader
ĠIn ter
b uf
st all
lay out
av ed
ĠJ SON
ĠSuppress Warnings
Ġbyte s
ĠDE FAULT
Ġe lement
ĠS c
Ġw ait
or ity
Ġsh ow
vo ke
O T
A vailable
Ġg raph
as on
L ine
ĠTh read
Z one
tor y
F ail
oo per
str ic
By Id
Ġc ursor
a use
Ġf irst
ĠL ayout
Ac tive
2 8
ĠM AX
strument ation
an el
o ice
ate g
tifi er
M s
is ion
R ange
F OR
Ġs ystem
In c
Pro to
ĠEX TRA
7 6
0000 0000
Ġr et
Ġv alid
Test ing
B undle
i es
ugg est
AN G
Ġgr pc
Re f
Ġc ap
im al
ĠN etwork
Cont ain
Ex pected
T AG
N ative
Ġw idth
r up
ĠS QL
De scription
Ġatt r
Ġo ld
nec ted
ĠE lement
M on
BU G
4 8
ĠA udio
5 8
ĠA bstract
9 0
N um
Ġre p
Ġf lags
I G
ĠString Builder
t le
W OR
ĠDe vice
R ow
Ġm Activity
O P
lob al
A ss
ic ation
LO W
ĠRun With
ĠV is
ĠmW ifi
IN T
E M
Mode l
n own
H ash
Ġm edia
Decl ar
la ce
Ġexp ect
Po inter
ĠD ate
Command Handler
Bound s
Ġproto buf
ri er
N ew
Ġdec ode
od ec
Package Name
G R
I f
F ocus
Ob server
a ss
ĠRemote Exception
w t
Ġin it
Ġu id
Ġre gister
U RI
ER R
ri x
eck ed
ĠST ATE
View ById
d k
unch er
ol ume
Ġcon current
ff ff
at rix
struc tor
w ord
ĠC ar
um mary
f or
C ATION
Ġres ol
g ion
Ġo pen
e g
Ġ1 6
2 7
P RE
add ing
ĠHash Map
Pro cess
ption al
Ġfind ViewById
A pi
Ġ layout
ĠAll ocation
stan t
Cap ab
Ġ row
it le
S U
lect ric
bo lectric
F uture
ĠPre ference
Par ent
Id s
Ġm In
E S
al led
Ġ< =
D S
ĠAc cess
Comp at
Ġfinal ly
n o
ens or
ti tle
rig ht
ĠL ocale
ic ode
Ġl ine
ph er
Ġ6 9
v as
1 3
OUN T
b ar
P UT
Hal f
b e
A SS
ce pt
ĠF LAG
E d
AR T
ri es
ĠCon fig
Inter nal
set s
6 6
s on
T e
ĠPackage Manager
Ġ Handler
O peration
Ġget Context
t r
ar ch
For Testing
Ġpre ference
ĠB itmap
Ġo bject
S uite
W ifi
re sh
Ġhe ight
Ġpar ser
Ġan im
ot al
e p
Ġin c
Ġc ts
Ġp m
Ġres et
o me
P ri
Ġd is
User Id
Ġn umber
Ġt ra
av ap
D ouble
g n
Ġm Service
Ġ q
St orage
F O
ERR OR
Ġto ken
Declar ation
uggest ion
i pher
ft p
t a
l ist
ro y
Ġset Up
b ug
Ġon Create
Result s
yc le
ched ule
ĠmR S
App lication
Al gorithm
Ġac tual
u tion
Ġg roup
ra pper
ftp server
ĠCollection s
Ġmock ftpserver
L ocale
Ġgraph ics
L ocal
atter y
A p
Selec ted
ĠComp onent
ĠDE BUG
ĠB it
Ġex ception
Ġvis it
Ġper mission
Ġg ener
Met rics
ĠByte Buffer
Ġc l
Call ing
l us
Ġs ign
Ġm Is
Ġpro cess
ot tom
Ġm ake
ĠP hone
Ġm Test
P ACKAGE
Pa ss
ar ser
ach ed
Ġhash Code
A uth
Regist ry
Ġatt ribute
Ġ1 00
Ġm F
. .
oun cy
avap arser
I P
st amp
Vis ibility
Ġ< <
Set ting
ver s
ĠLO G
Ġs aved
ĠVis ible
Ġte mp
e me
0 1
4 6
M edia
a f
ĠA rg
as y
ĠVisible ForTesting
Ġn etwork
7 7
i od
Th row
4 9
C OUNT
iz ation
ateg ory
t oc
ĠPar cel
SER VICE
V ariable
I terator
Ġd rawable
ĠU til
p ro
D el
Ġl ocal
toc ol
ti al
ĠA tt
ĠR ect
Ġw ifi
S ame
Ġassert NotNull
AP P
z z
Ġget Class
3 5
il ities
P anel
ith ub
ĠCol or
ĠF ield
ĠV ER
ĠS p
Instance State
ust om
cast le
Arg s
ouncy castle
Ġ Entry
Preference Controller
T ENT
50 9
k nown
ram ew
o x
I FI
ramew ork
ĠX ml
Iden tifier
Ġb ouncycastle
u i
OU R
W h
ack et
Ġ" /
ph a
Vis ible
m it
ĠN o
Ġn io
Ġr aw
Ġm et
EN D
; "
S upported
D ATA
Ġm ath
ee k
T itle
AN CE
li b
Re port
ry p
Ġcol lect
l ation
D i
Ġin itial
L abel
O ff
H E
I M
H T
I TY
Ġno tify
ĠAn d
I C
2 5
fl ater
Pro perties
ĠS imple
ĠN ull
ĠBig Integer
d ition
Ġap ache
ĠAnd roid
R o
ĠL ocal
isp atch
ĠE vent
ĠArg ument
V ENT
P ORT
Ġl en
Ġget Int
Ġm Device
Ġx ml
ĠS E
C ertificate
M AT
ĠUser Handle
Ġj j
P attern
Ġm H
( )
ĠIn putStream
Ġannotation s
u ard
Ġc ert
ĠB ase
Cap tor
He ad
A IL
Ġas List
B inder
ĠB efore
Ġi terator
ard ware
le ase
O ver
C an
ĠE asy
ce lable
ĠC alendar
Se lection
Field s
Ġrun ner
Ġres ponse
O p
P O
def ed
ĠTe lephony
j ec
On ly
ĠW indow
ĠG ener
4 7
M in
ĠImmutable List
s ing
B LE
ĠB uild
ifi ed
Gener ator
y mb
2 1
ymb ol
Ġl ock
Ġp kg
Qu ery
ĠEasy Mock
Key s
b el
Sc an
P ort
AC E
ress ion
pc ode
Click Listener
Iden tity
v ision
D ig
Ġre ader
ĠN ode
Ġassert Null
B oolean
O D
in ue
O F
Ġro ot
e b
Ġqu ery
Ġin voke
U ID
Sc roll
U SER
c c
ap er
Ġexec ute
D uration
M ax
Met adata
st ore
Ġin V
S L
Ġp ri
od ing
Re ply
Ġor ig
Sh ow
ĠChar Sequence
W rapper
Run ner
ĠU N
ĠF loat
Ġtra defed
To p
b s
ĠmC urrent
ĠI mage
I ME
lic e
Pro xy
Ġs rc
UL L
Ġm ulti
Ġ ss
ĠD ouble
Ġf il
I mp
Ġ- =
on t
ĠM et
m all
ĠS ub
l ot
Ġs upport
AT US
Ġm Handler
Ġ State
: "
Ġst r
Ġtr ack
ĠE N
ĠS log
Log ger
S A
ĠN O
9 8
9 6
Ġcomp onent
3 1
Ġget Key
State Exception
Attribute s
Ġte lephony
ar ted
p end
act s
] "
ĠP a
ĠIn valid
CE SS
ay load
S Y
Ġm Re
Ġl ocation
E mpty
Ġcont inue
ĠS ervice
Ġas n
Ġ" -
Dec imal
en ted
ĠRun nable
ĠTr ans
tion s
Ġget Default
A RE
Ġle ft
A g
De f
R ect
C om
Ġb ind
g ing
Ġsaved InstanceState
ol l
WOR K
r l
Ġget Type
od y
Ġm Controller
Pointer Exception
O ps
w ner
B e
ad io
R oot
N onNull
ol d
ow ed
ib r
ĠL ink
t p
Ġd om
Time out
In valid
On e
bo ard
In itial
P ool
C L
pp ed
ĠComponent Name
D OW
la p
Ġo p
L ocation
ĠText Utils
Char acter
c ore
la zz
Ġb ack
u sed
Ġm V
Ġcol umn
Ġ- -
Test Case
if ec
Ġget Content
ifec ycle
Ġ Int
ĠA C
all p
ĠText View
R L
Ġcomp are
8 6
ĠM IN
Ġac count
or der
IL LI
ĠC amera
C ard
unch ecked
rup ted
Ġ St
Ġl ocale
Ġpre v
CH ANG
Ġt ask
Ġcol or
2 3
P hone
Ġd ump
or rec
in ish
Ġc amera
Ġe mpty
orm al
ĠgetS ystem
OR Y
av ig
m ail
Det ail
p oint
an if
Ġget Message
Pre sent
AS K
ĠA ss
anif est
Sp an
t ain
lic it
allp aper
B ox
M ENT
Ġd b
M odule
Ġa uto
Ġde f
o ve
Ġp hone
Ġvalue Of
ĠC an
ĠNull PointerException
p ed
Capab ilities
Fail ure
me d
ĠTime Unit
Ġwait For
App Usage
AC TI
ut of
Anim ator
Ġpro g
Ġst op
l at
ter able
Ġset Text
ĠAtt ribute
Ġs pec
Ġc al
ĠIllegal StateException
W idget
prec ated
Ġn otification
Ġd i
E W
ĠByte Array
X T
Ġcommand Handler
u age
ing le
Le ft
NO T
Ġm Lock
L Y
B Y
ĠB oolean
st ring
P H
i as
f oo
Package Manager
Ġ1 000
W rite
g in
ook up
Re stric
ent ly
ĠT o
Contain er
ON G
Short cut
Ġh ost
B O
Ġget D
at ing
o tion
k ey
ĠUnsupported AppUsage
O K
ĠO P
I F
lec tor
ar ator
Ġhand ler
Ġ Y
Ġen c
Ġcon nection
VI TY
ject or
E ach
utof ill
ĠM E
w o
A U
c lass
Ġu i
ĠB inder
Ġattr s
ĠC OL
N on
CO MP
SS AGE
Ġhe ader
Ġla bel
Ġm G
ĠU SER
Ġapp ly
or al
En v
ix el
UM N
To uch
ĠI terator
Ġres ource
CT ED
B itmap
AC T
ĠA L
CON NE
O ption
ET WORK
ĠS e
Ġj avaparser
Ġer r
Direc tory
T race
Ġto p
Re p
Ġpre fix
QU EST
n ull
Ġst yle
In vocation
S dk
Ġsec ond
Ġext ra
h ot
Pa ir
B ind
Ġro bolectric
Ġo ptions
Ġp ost
ist ory
ST EM
Trans ition
ĠB uffer
Ġget Resources
Check ed
ID E
M od
R ender
L atch
M enu
Ġde lete
Ġde x
Ġ3 0
Ġcon vert
ĠIn et
n ing
VAL ID
LO CK
S urface
ABLE D
W N
J ob
Annotation s
Byte Array
S ample
Ġm A
4 5
m ain
Data base
C lock
y s
ĠP RO
FI LE
Ġmode l
ers ist
DE X
= =
k ip
ro p
ĠPar am
Con nected
Ġcont rol
ĠUn icode
ĠT arget
Ġs erial
ig h
s ert
ĠI D
B ER
L ast
De legate
Ġg ithub
A fter
form ation
qui red
lay back
Mon itor
oun ter
i e
m t
Found Exception
S uggestion
ĠVER SION
f c
C AL
Ġcan cel
Selec tor
Ġg l
AC TION
O pen
ĠS H
Ġadd ress
un k
Ġ right
ar m
St arted
Permission s
A SE
Vis itor
Sc ript
7 9
S uccess
Ġac cess
Ġp o
EN G
ĠM O
Ġv al
ĠView Group
Ġ and
ĠE C
RE S
ĠRec ently
Con structor
m er
Element s
Match er
ĠRetention Policy
D ay
Ġm User
Ġt able
Ġfin ish
Sc ale
T ree
er ator
OUN D
Pre fix
b m
CON DS
C ert
ĠT R
Ġn e
V ideo
s um
> "
Ġob tain
orrec t
AD D
Ġtest ing
j ava
' t
TIME OUT
r an
d u
AR Y
Cap ture
en tial
B roadcast
Ġset up
ĠD isplay
Back ground
Ġm I
ĠAccess ibility
u id
Ġac cept
S ync
r id
Ġfor Each
CO L
Sec ond
m ark
ĠBig Decimal
ĠObject s
Preference s
ĠP rint
Ġth at
F ull
Ġf ragment
Ġde legate
Ġin d
AT OR
ĠAn im
Ġd irec
Prog ress
Ġget Activity
G N
ryp to
AN T
Pro tocol
Ġd ate
ĠApp lication
Stat ic
TE XT
o in
Ġstat s
mpl ate
A ST
ĠO ut
Ġ Status
Event s
ĠA P
Ġ" .
P ull
TI FI
Callback s
R aw
ST ART
STR ING
Tag s
Operation Exception
ĠmL ast
Ġ" <
ĠN ame
g ed
a uncher
Par cel
gn ore
5 2
Ġt mp
en ch
Not FoundException
SH A
io us
Ġf rame
Ġr ule
LE D
Test s
Ġencode d
Ġs q
et ers
Item s
ĠDe precated
jec tion
4 2
F IN
Ġde scription
Ġu se
Ġm y
C ar
M em
Pre view
Ġm Listener
Ġcall ing
ĠChar acter
S witch
C odec
ĠN umber
Ġh ardware
U se
Ġi mage
ĠC ount
Ġre ply
lap sed
L oad
Per iod
Ġic on
M IN
ĠHash Set
Ġcan vas
Ġget Text
DI S
De lay
F inish
EL D
Trans action
Ġext ension
ĠBit Stream
ĠF or
Track er
d en
In struction
Change Listener
ag ger
I LI
ĠUtil s
C ALL
ĠSh adow
Ġb lock
\ \
in ary
Ġarray Out
Ġm ust
ĠA R
ĠLayout Params
Ġs uccess
Ġr ange
Ġm App
Ġw riter
Ġw indow
ĠS Y
Trans port
otion Event
ĠA tom
Ġl imit
x ed
C urrent
ĠgetSystem Service
Ġtime out
F unction
E C
Ġc lazz
2 56
I TH
Ġc ache
A V
B ACK
AR D
Ġa ss
A re
C ursor
ĠE rror
Ġf ailed
lo sed
V olume
ĠIN PUT
ri e
ĠUnsupported OperationException
6 8
Ġsh adow
Ġg wt
Ġe d
ial er
0 2
C RE
N UM
r en
Ġ3 2
Pa int
FF FF
M easure
P acket
Ġfil ler
Ġs ample
ix ed
ĠInter rupted
Constan t
Ġm ain
uc k
L ink
M L
Sub scription
M IS
ĠM S
B uild
I ST
/ /
que ue
Ġsc ale
Ġrec ord
Ġapp lication
ĠD OM
P AR
Ġf ound
Ġse lection
L en
NO WN
x ff
Ġtime s
OUR CE
Ġdest roy
g ment
m d
V er
En code
g r
Ġset On
ĠI terable
ench mark
ĠS SL
ĠF ragment
Ġrep lace
ĠSh ort
AT URE
D ocument
Ġth read
Ġex ample
U B
R ate
a de
Pre f
Ġsp lit
Ġi t
Pull Parser
N an
Ġ title
ĠP ath
Ġget A
Ġm State
Ġcl one
d uc
ĠS mall
ĠG L
Ġget Re
U rl
C S
r in
ick er
Ġst ub
par se
N T
Ġl ib
sp ace
ir on
P adding
ĠI ms
g uard
Ġre ason
Al igned
iron ment
IN TER
Ġ Ex
ĠF I
ĠPro cess
re s
5 3
L imit
ĠS ocket
S uch
Ġget Device
ĠIn put
Ġa uth
e k
mi tive
FI G
Ġgener ate
EX T
ending Intent
ĠLink ed
in es
B it
DI O
ĠG lobal
c s
0 4
ENG TH
af e
ff ect
sh ould
Ġe lements
lu de
P layer
Ġt otal
ation s
ĠInterrupted Exception
ra p
i ss
RE AD
Cont ract
el f
ĠD rawable
ĠJSON Object
Ġre port
Ġen able
of t
Column s
la xed
Ġp ass
Ġf ramework
Time Millis
IN S
er al
To String
Exp r
y ped
id i
ap p
ĠM ain
Ġb itmap
est ure
ĠSmall Test
Ġen abled
Ġf unction
ĠC O
Ġcap ture
D ER
ĠSec ure
J Unit
App s
V ector
Ġf ill
ĠC ap
7 4
ĠS ession
Met a
ac y
Code s
ĠMS G
6 9
Ġtest Get
al igned
li er
O wner
r inter
Se arch
ILI TY
MIS SION
ĠV I
TE S
red ential
ĠD ocument
Ġget In
ĠJ ava
K NOWN
Ġassert Same
Ġ Resol
Ġt v
n ess
M ain
en ded
li p
ĠNo Such
Ex act
O FF
G L
Ġon e
c omp
Ġresol ve
ĠgetC urrent
Ġsystem ui
C amera
Ġset S
DE FAULT
ing er
o pe
ĠS urface
Ġtest s
ol ver
d ata
ĠR UN
anag ed
ĠAtom ic
Con nect
Un aligned
Ġget Id
M A
8 9
F LAG
Ġc ur
ic ator
n g
Ġ Value
ĠAn notation
ap e
Ġdecode Per
Con vert
Ġre quire
Ġur l
l ta
ĠS ign
ĠXml PullParser
Env ironment
Ġre lease
CON T
Ġm Preference
pe ated
ĠTest Case
P RI
= \"
Method s
ĠSec urity
Ġorig inal
ĠC ursor
con t
Back up
ĠU i
yn am
Exp ression
Comp lete
w ait
ĠR o
vision ing
Ġin vocation
AR G
B E
Comp let
Ġ Stream
5 1
en ame
lec om
er o
ĠH e
Att r
Ġpre f
s With
A r
Ġm od
m a
Ġi bm
R andom
C ategory
Ġ: :
uck et
ynam ic
Ġp op
prec ation
o ord
Ġin valid
eth er
IN E
In flater
Ġ. ..
Ġcomp ute
Ġany Int
TE ST
i an
Ġdo Return
SI BLE
RO L
B its
ĠO ptional
ĠA N
ic ate
ent er
Sh ould
Ġo ff
r et
ĠP er
ĠCont acts
ss ible
ĠIn strumentation
Ġf actory
v alue
de precation
En g
Re ason
m ethod
ĠINPUT SIZE
n s
Ġd oc
Ġsc ript
ut om
Ġd raw
nec tivity
ĠKey Event
R ight
Ġarray In
S erial
ĠC om
ST ATUS
ac ity
ex pected
sum er
Ent ries
ĠH ttp
C Y
ach ine
main ing
Package s
Ġst ack
s b
ĠRecently NonNull
Ġj ob
File s
Re gion
W ork
im um
: //
ĠCOL UMN
ay er
b n
ĠC H
CHANG ED
O C
ublic Key
Pass word
Ad min
im ension
ay s
FI X
Ġex ist
Ġv ersion
and ard
Ġindex Of
LO AT
N ONE
ĠC ertificate
ĠM otionEvent
ĠE VENT
Enc oding
Encode d
p ol
n ot
Sign ature
ĠCON TENT
S UP
Head ers
Ġget Child
Format ter
Time stamp
Ġ2 00
D est
Ro ute
Ġ1 9
ĠI Test
Ġw as
ĠD IS
Ġsub string
6 7
re gister
Text ure
Run nable
T ING
M atrix
Ġm on
ĠV oid
Ġd ispatch
vers ation
w ard
Ġp ort
Ġm Data
ACTI VITY
Al pha
Prog ram
CODE S
ĠT IME
or ed
Ġj son
Ġd agger
lat form
0 3
ang uage
ĠConfig uration
K ind
m al
S upp
Ġu p
R et
Re mote
con nect
Date Time
Ġs uite
Ġ $
4 1
H istory
8 7
Ġind ent
Ġm View
MP TY
p os
Ġadd All
Ġcheck NotNull
Ġin ject
n ap
RI P
if ication
Sh ared
TH OD
Dec oder
AT CH
Extra s
O verride
Th e
Ġin sert
Ġb undle
Ġ" :
ĠAc count
Down Latch
at t
ition s
ĠA U
ir m
ul ate
Id le
Re move
ann ot
Ġchar At
ch eme
Ġsq l
Ġm E
RE QUEST
h ttp
i v
Eng ine
4 3
Exp and
ĠIn vocation
Ġb it
Ġhas Next
D raw
IN DEX
} "
Ġhe ad
Ġ1 1
Ġp a
Service s
A uto
lec ted
I TE
ĠP attern
a a
St op
d p
Ġf eature
Ġ| =
s To
Ġ Enum
Ġis True
as ic
p th
SU B
Detail s
er e
DE VICE
l an
d own
iz able
P S
b ers
Ġ" (
mo ved
M achine
ĠR S
ymbol s
hot o
Ġ4 2
Ġparam eter
6 5
Access ibility
NUM BER
ĠC ell
Ġcontains Key
st ra
ract or
W ait
File Descriptor
In sets
st art
a unch
re ment
Ġa udio
re g
001 000
Ġm em
ĠA d
ĠFor mat
Ġd ialog
t f
ook ie
w er
M AN
Ġb ottom
ĠB utton
rig ger
ĠT ree
L ooper
le ep
ĠRUN TIME
v ide
Sh ell
am l
Ġwrite Int
B G
Ġm Content
ĠE d
Ġlib core
Ġget PackageName
T RI
Ġimp l
Ġtest Field
Time Zone
E qual
Ġsub Id
Are a
j ust
ĠgetContent Resolver
ĠA s
Ġarg ument
ist ance
Ġ Resources
atch er
Ġp art
0 8
S a
Q ual
ag n
ĠS parse
Argument s
ĠPa ir
M AX
Policy Manager
Ġd uration
DE D
a ded
fer red
ĠP K
ĠI mp
I RE
z e
ĠContent Values
Sign al
ĠRe ply
V ar
pcode s
ĠmT e
Ġa pi
p ath
ĠM enu
LE S
ĠTelephony Manager
es c
Ġget T
Ġsign ature
able Future
D ATE
F E
ry pt
SY STEM
Ġn ow
ee p
ĠSQL Exception
ĠInet Address
ĠC ode
ĠI Binder
Ġre cei
op layer
ĠL ine
F R
Ġle vel
P rivate
B efore
Po ssible
ĠPar celable
ĠP rec
ĠN on
Ġset Visibility
V oice
if ic
Ġanim ation
P ixel
Ġa wait
Ġex oplayer
C alled
b ugg
B luetooth
ĠPro vider
e er
p n
lement ation
; \
VI EW
c p
Ġc ause
own load
H as
ĠP AR
Ġp attern
Can cel
Ġm ove
all y
Se lect
TIFI CATION
0 6
ĠD ialog
Info s
Ġm Key
ĠCount DownLatch
Ġa fter
Po st
p re
Ġbe gin
M ASK
ĠF unction
ĠM ulti
let on
ri m
FOR MAT
ĠGener ated
M sg
P ower
Re al
Ġd ig
eng ine
SE CONDS
ic c
En tity
SI GN
Ġla uncher
Ġ" [
Ġs ocket
Message s
UR ATION
Sp ace
M ask
Ġpro file
Ġget F
Ġvalid ate
r ation
Text View
ĠG wt
in ation
In stall
b b
7 2
Ġm odule
Ind ented
Ġm N
o per
us h
ing leton
Ġsc reen
Ġm Callback
Ġ2 2
Par t
Ġb luetooth
Ġcontrol ler
Test er
w w
Indented String
M M
p le
AT H
Te mp
Res ume
ĠDe fault
Ġa re
oo p
Hand sh
g l
Ġmatch er
Ġd st
UR L
ĠM anifest
Parameter Spec
ĠS I
ILLI S
cy c
Ġput Extra
ĠS erial
Ġn on
Ġkey Set
Ġnew Builder
All ocation
Ġpar cel
Ġr andom
J E
ĠAc tion
View s
Ġset Content
Ġm enu
Ġ Stub
m y
for ce
Ġget Next
8 1
Rule s
Ġ Result
Dig est
W ITH
ibr ary
er ge
Ġd ir
C AP
w ith
c t
ĠPro to
E AR
N ETWORK
over y
ĠBluetooth Device
ron o
ic le
O O
Str uc
ĠmS ub
Ġauto test
Ġcont act
8 4
g ency
LI ST
All owed
De bug
Ġac tive
AS ON
Record ing
ĠAndroid JUnit
Ġi ter
vel oper
Ġget Bytes
pol ator
s age
Read y
Ġ Executor
Ġss l
Ġextra s
l ative
Ġ2 4
ment s
ĠIn struction
Di ff
F lag
lus h
Ġcomp at
st at
M I
fl ate
Ġm O
7 5
Ġ1 5
n ers
Ġre cyc
ann er
i pe
Col lection
G ER
ĠgetB oolean
lit erator
RE EN
ab ility
Con dition
Ġresult s
Ġa vailable
Ġf d
Array List
C alendar
Ġsc an
C ell
C ATE
R otation
Ġget Tag
ĠU RL
EN CE
Ġb ound
p rint
S yn
Ġread Int
N S
FA IL
at as
p ackage
Ġs kip
ĠSub scription
sh ot
Mon th
id den
P age
6 1
Del et
ĠAss er
M D
Ġto IndentedString
ST ANCE
Stack Trace
Ġsettings lib
ifi ers
re ator
ĠM y
Ġcon nect
B C
stra int
Ġse lect
LO AD
Ġm On
L ENGTH
id ate
SC RIP
ĠA T
P ayload
og gle
ĠE MPTY
l ing
ĠTe mp
s i
ĠP ACKAGE
act or
ĠLog ger
ist ics
Ġall ow
Ġr s
Ġget Column
mer gency
ĠME SSAGE
ĠU Locale
Action s
Dis abled
ĠParam eter
e ground
ĠPar se
99 99
ĠmM edia
ĠCh annel
DOW N
Ġget Display
ĠS erver
nap shot
S ummary
ĠAttribute Set
AL LOW
Over lay
RE G
E VENT
Ġin Order
Ġh ave
As ync
C ause
Ġparam eters
Ġent ries
ĠP ER
C I
ub ble
ur al
ĠWindow Manager
Run ning
ce ive
and idate
Ġun register
chedule d
Ġall oc
ĠRE S
Ġ6 0
Ġm ay
ĠP RE
it eral
Ġen um
ĠData Type
ĠCap ture
Ġget Data
ĠMO DE
P K
Ġa st
pe ed
Ġh el
1 00
L ayer
CON FIG
la b
ĠBitStream Reader
EN ABLED
F ER
ĠD esc
ime Type
ĠArgument Captor
er min
TER N
In sn
Ġ engine
ĠSc an
Ġset Enabled
12 34
Ġb utton
Ġor der
resh old
er ies
r action
ĠG u
7 3
o ptions
ĠD ec
vid ers
2 00
arg e
Ġ unit
Recei ved
ter nal
ag ing
Ġcontain er
ĠTime Zone
par ator
Ġprev ious
M ILLIS
urr ency
S ms
arg in
ĠmD isplay
S ave
ĠWifi Configuration
M an
im er
ĠF ilter
Ġ3 1
ond itions
e ak
TI VE
Par celable
Par se
Ġad apter
ĠR andom
ĠBuffer ed
h er
Ġ" %
Ġlog ger
ĠByteArray OutputStream
C ipher
X ml
I ms
ĠB roadcast
ĠPrec onditions
S im
M ore
ĠC OM
Ġc ell
ĠmC amera
I Z
ĠD ATA
RE SS
iss ing
ĠU T
Ed ge
Set up
Ġ4 0
S upport
ch or
Al ias
ld r
Ġal gorithm
st ream
To Message
stan ts
Ġper form
ĠR ange
Ġre mote
Ġh older
\" "
Ġget Service
ĠI ke
Ġde lta
Ġ ti
TH ER
Ġ5 0
Ġget Application
Ġv er
c ard
Ġs upported
Ex ist
Ġerror Found
m od
ĠImmutable Set
FF ER
ĠSystem Clock
il ation
I gnore
p are
TR AN
AIL ABLE
l ish
ĠCom mon
Ġm ark
ĠF LOAT
ĠIN VALID
ar Down
Ġa b
Ġget Possible
ĠF ake
Contact s
Dest roy
D AY
ress ed
IN DOW
ĠDesc ri
Ġd et
avig ation
C lose
ĠI S
c at
s m
v ity
ch ive
ĠCall back
bugg ee
Ġto Array
ri ent
Ġmatch es
Ġde bug
ĠP RI
ir tual
SH ORT
l s
Ġs ort
iti ve
Ġin stall
in ner
p ing
Ġte arDown
First Tags
6 2
Inc omp
C R
Ġse lected
ol ute
f d
ĠP endingIntent
Ġsp an
A ssert
I p
IG HT
Call s
Ġthrow n
Ġ ERROR
Y ear
ra mm
State Changed
ĠO ption
ĠmC lient
ĠReply Codes
en c
la red
Ġf ull
Ġtrans port
VER SION
ĠgetPossible FirstTags
ul ar
SS L
ĠUser Manager
c opy
ramm ar
ĠN AME
Object Identifier
Ġt race
ĠRe quire
OR ITY
G ORY
Ġc rypto
og n
SC REEN
b oot
h e
Test Runner
NE L
Ġde sc
Un known
ĠRe quest
Ġre g
Res et
Del ta
P icker
et ric
Ġch ang
ĠR ule
ĠOut putStream
ĠAP P
bs olute
rient ation
A W
Con f
Out Of
E E
Ġsend Message
it Text
AT ED
TI AL
Ġf oo
8 2
Ġref lect
Trans form
Restric tions
Ġi p
Ġo ver
Run timeException
S PE
Ġ Resource
Hash Map
Ġencode Per
Ġne ver
O ptional
ra vity
Ġget Height
ER T
IN FO
Ġencoded Bytes
ĠPa int
Ġput Int
vo k
ĠString Buffer
B IT
Ġget Width
ĠC L
Finish ed
UN KNOWN
Ġdi ff
R AY
Ġf uture
g o
Car rier
Ġget Element
Ġb inder
ĠE GL
Ġs urface
Ġexec utor
S ensor
0000 000
ĠmC ar
l ong
J ava
Ġpro perty
-- --
m ode
ATI VE
L ite
ĠTR AN
A b
6 3
ĠUnicode Block
P ending
ler View
Ġpri ority
Ġs ave
Ġif ace
eg ative
ĠPrint Writer
ĠIntent Filter
ĠCON T
ĠInstrumentation Registry
G HT
at ible
ar ded
ĠAs ync
Ġm Log
ver se
He x
ess aging
Exec ution
ser vice
if y
Nan os
Ġget Count
Ġla unch
ĠA D
Content s
Te mplate
Ġappend Variable
Ġclass Name
ĠRun time
ĠappendVariable ToMessage
E ffect
Pri mitive
In it
Ġget Test
V al
erif ication
IDE O
7 1
Device s
Request ed
Ġv ideo
Ġentry Set
if t
ĠNumber Format
5 00
Ag ent
Ġtrans form
p ers
Ġm Notification
Class Name
Contact Id
s ub
Ġid en
an k
ched ul
S ingle
ir ror
CON TENT
D R
Ġs leep
B R
OU P
Inter action
CL ASS
D ispatch
Meta Model
Ex c
Ġget User
T P
ĠP oint
Ġget State
Ġtemp oral
En ter
Listener s
DI SP
ic ture
Wh en
Ġ ^
A IN
ĠCon stants
ĠL ooper
FI ELD
G ET
Ch ain
Ġpo licy
r ong
R at
P rint
f e
ĠLayout Inflater
c a
ens ity
ĠC ALL
W eek
B ottom
h s
Ex ternal
C opy
Ġj oin
Ġcurrent TimeMillis
ĠmB ack
ry ption
Ġre ference
Process or
Re quired
ĠD BG
T ab
Ġin struction
ĠM easure
AN NEL
Ġprog ram
or iz
S elf
Ġdo es
W ord
ut down
Ver ifier
ĠZ ip
S olver
ĠF rame
Manager Service
Ġget Action
0000 00
ĠU S
Ġwrite To
Str ength
lu ded
DI RE
V O
o aded
CON D
C oord
ĠPro g
C C
ĠRe f
Ġconfig uration
Ġmet adata
Ġsyn c
Enc oder
ic tion
Ġget All
ĠVI SIBLE
B ody
B I
Ġc b
Ġinitial ize
M AL
P C
ec h
Po p
ĠCon nection
Complet ed
i um
Ġse gment
ad i
ĠNon null
sc reen
s igned
Ġs ip
FI L
Al arm
Th eme
Call er
State s
Ġde veloper
d ma
ĠC lient
Multi map
Feature s
n ode
ĠN ative
ur ve
D o
F m
Calling Identity
Ġm anager
n el
ĠmC ol
A E
oc i
BY TES
OutOf Bounds
H int
0 5
ri p
Ġb l
Ġre store
Child ren
Ac tiv
Ġi ms
Ġattribute s
ĠF E
SET TING
B ug
Ġdeveloper options
l ang
Ġs lot
Ġo k
et ch
ch ar
B uf
ĠJ Unit
Ġro t
ĠApplication Info
ĠTemp oral
H O
Ġre gion
inger print
on ical
Ġw ork
Ġbe fore
r t
ĠBroadcast Receiver
C redential
ĠM ILLI
Ġs imple
Time Ms
MP LE
Ġc t
Regist ration
ĠS ET
r m
g reg
in ed
ĠSI ZE
N C
a z
LO G
w ays
Capab ility
M ath
ul ator
Ġs m
Ġd ialer
ĠB attery
le x
RE AM
G lobal
ĠV AL
C CESS
As User
all back
ak er
atas et
ric t
8 5
ve Info
AD ER
Ġstart sWith
Ġre al
Ġn ormal
ĠAnim ator
Bind ing
View Holder
Incomp atible
0 7
Ġm erge
L ookup
Ġtest Set
0 9
8 3
ĠContent Resolver
Ġn an
Ġad min
ran ch
PORT ED
ĠM od
e h
Ġh ttp
R SA
ĠZ one
ĠM ET
U uid
Wh ite
ĠD irec
ON TH
* *
Ġnew Instance
C ast
Ġget Long
ON ENT
ĠBit Set
b yte
Ġ1 4
Ġm List
st er
Ġtest ng
L S
ĠE ap
ME SSAGE
Auth ent
un er
ER O
ĠRe ference
F inal
ĠRES ULT
Con straint
Ġc p
ĠR aw
ĠmP hone
Ġget Target
Ġref resh
U I
val u
Ġm Audio
Ġf lush
oriz ont
WOR D
ĠmM ax
ĠT v
DISP LAY
C ounter
W allpaper
Ġget PackageManager
w k
Ġsh ared
ĠSystem Api
t able
ĠSecurity Exception
k i
Ġm Network
ee ded
ens ure
Ġerr ln
Ġr ender
Ch unk
ĠSQL ite
ĠST ATUS
Ġo ption
ic h
Ġm Adapter
qu are
De sc
chedul er
ĠgetS ub
UT O
ĠRo bolectric
ing Mode
Ġwh at
Ġstyle able
ra pped
l ow
ĠFile Descriptor
Direc tion
ĠA fter
ĠW IFI
ĠByte String
OutOfBounds Exception
ffff ffff
Ġ ensure
s ec
um my
Ġcompare To
n t
T wo
Ġtr uth
ĠTr uth
pend ency
Tr ust
Ġdata base
ĠJ ob
d mi
P h
Ġf ake
x c
0000 0
S lice
arded By
lic ant
A F
st alled
ĠLog Util
oc used
Pri ority
I R
Ġ queue
ĠL ONG
Rec order
avig able
ĠSign ature
Ġis False
ĠS ize
Ġtime stamp
Ass et
Ġget Time
ĠTo ken
Fm wk
or g
C ustom
ĠM atrix
Se ek
Ġtrans ition
Handsh ake
I LED
Ġv ol
Pre ss
AAAA AAAA
in ition
le m
P layback
Config Manager
M ark
Ġ 99
Ġget Parent
ĠN UM
Res Id
ĠU RI
Ġget Component
For eground
Ġtype s
L INE
ĠP O
Ġal pha
G raph
Ġset Value
orizont al
Sc ore
I face
ĠC ipher
ĠT able
ĠmS ession
Ġl ookup
Ġb enchmark
G esture
Ġto ByteArray
ĠComp arator
ĠL e
9 5
P LAY
ul ated
L ONG
Ġin flate
o v
ĠGu ardedBy
H AND
Ġs upp
Ġargument s
ĠS ms
ĠM em
Ġs ig
ĠSerial izable
12 8
ĠHe ader
ĠActivity Manager
M AP
x d
scri be
i re
Ġevent s
A Q
ĠIn dex
ĠByteArray InputStream
P lay
Ext ractor
ch annel
x b
Ġget Dec
Ġrun ners
Z ero
ĠTest Fmwk
ĠO N
Ġkey s
Exact ly
ĠArray Map
eh icle
M irror
AU DIO
56 78
yc lerView
Th reshold
ro ss
Pre d
m atch
L iteral
Imp ort
Sec urity
s wer
Ops Manager
SCRIP TION
ear ch
Ġget Method
9 7
ĠS earch
Ġs chedule
AB ILITY
M B
ub lish
x FF
Block ing
New Instance
P L
Ġput String
om ain
A IT
S te
Ġget Item
sh ort
Ġ Extension
ert Dialog
ĠM ATCH
001 00
Ġcopy To
P in
ĠB ack
F oo
AV AILABLE
En able
u de
Ġon Click
Ext ended
ĠS UP
9 4
oft Ap
Ġc lean
L anguage
, "
Re gister
o se
DE LAY
ĠS ER
ĠN ETWORK
ĠOn ClickListener
R adio
Ġen force
over age
in fo
ĠD is
L aunch
Ġd ocument
i mp
Pro p
Ġarray copy
W ID
ĠT yped
Ġ" ]"
Ġis In
Ġun known
V ID
u ser
per ator
Class es
ĠMet rics
Ġback up
P T
PER MISSION
Id x
set tings
ĠSparse Array
GR OUND
Pre v
State Machine
Ġget Preference
ĠCar rier
S end
ĠArray Set
m ount
i om
Ġe lapsed
ĠL A
ĠCan vas
ĠCOM M
ĠSt andard
u til
e ed
ĠB lock
Re g
ac ing
Ob j
A KE
ĠI C
Ġcopy Of
ĠCon stant
p ri
Ġch ange
Ġz one
ĠgetM ax
Size s
te mp
ĠT ag
Ass ist
Ġdef Style
ĠR pc
Ġget O
ifi able
e ight
B and
Ġz z
ĠDE VICE
RES ULT
in line
Ġget E
All oc
ĠShort cut
In jector
ĠMod ifier
ĠCh eck
Sh adow
Ġ" _
Ġap k
UR RE
Ġpar sed
ear able
Target Sdk
W P
ĠgetL ast
Ġis Valid
Point s
pp ing
Ġe v
Ġverify Results
Time s
CH E
S lot
i ted
ĠMILLI SECONDS
Ġ" '
in ator
Error s
M ARY
ĠMockito Annotations
Ġl p
ĠmH as
Throw s
D URATION
ĠFE ATURE
v ance
ĠTo ast
Group s
ar Layout
ĠSe quence
Delet e
Ġget Attribute
== ==
D ING
D ump
P ATH
Inter val
Data Source
adi us
Ġcontains Exactly
MO VE
Match ers
St mt
Ġm Input
Ind ent
Sub type
A utom
est ed
OR MAL
Check er
ĠMet adata
Initial ized
read y
Cap acity
ĠST ART
rin c
W atch
Ġ Stats
V ATE
Ġs w
ĠCont act
rinc ip
Ġassert Not
ert ical
F ixed
W IFI
rincip al
s o
9 2
ss u
ĠImp lementation
Render er
Ġchang ed
Ġsp y
c ent
Ġmay be
Ġw rap
nectivity Manager
Re moved
C urve
d ir
oc ity
ĠarrayIn V
CONNE CTED
re ation
Ġ" )"
G B
IF T
Real time
Ġm Fragment
Account Handle
ĠR ender
ĠmP ending
ĠN OT
ĠV ideo
Ġmon th
Not Available
Sp lit
c ol
f ield
ĠUT F
re qu
ĠEx if
Ġid x
Ġse arch
CH AR
ĠL ocation
Ġs i
Ġfilter s
ĠgetL ocal
ĠA uto
Ġre maining
lu gin
ĠKEY CODE
Ġnew Value
Exp licit
el ocity
Ad ded
I O
N ULL
Ġconfig ure
Ġb ody
Ġall owed
H ome
ĠD AY
sent ation
Pri mary
( )"
RE ASON
Ġcreate S
Ġget Path
ĠS ensor
Object s
Ġfield s
S orted
C OR
Changed Listener
D EN
o ff
Spec ific
ĠO pcodes
SI TION
Ġp ayload
ĠJ son
Access or
Ġde lay
Ġt rim
Ġz ip
ĠAl gorithm
i que
ĠF OL
And roid
Ġresource s
D P
ĠAsser tion
Ġ1 3
U ST
Ġd ay
ĠAudio Manager
Pa use
et ic
Ġre laxed
ĠmB luetooth
B ad
n ed
O B
S ink
ĠG LES
ss id
ĠF OR
L ibrary
Ġc md
Ġpro xy
G EN
N eeded
ĠS OURCE
Ġ qual
end or
Ġcol lection
B attery
rib ution
Ġcomp ile
ĠmW indow
VID ER
Ġfor ce
mod ifiable
Ġl ink
lo sing
R pc
Ġy ear
To NewInstance
Ġc odec
F C
Un der
ĠdecodePer Aligned
ĠdecodePer Unaligned
ĠCon current
Ġmet rics
C lear
mal i
Test Suite
E P
ĠU sb
Ġs ink
Ġd x
ann ed
ĠPro perty
19 2
Ġfile s
Ġt z
bo x
ĠT EXT
Ġfail ure
right ness
x f
ser ial
JE CT
Ġent er
ĠCommand Names
Ex it
t ml
Ġis Enabled
Ġsession Id
Imp licit
ĠL auncher
Ġdom ts
T LE
Ġpass word
ĠM ode
Ġp ush
on es
ĠResol ved
Ġp s
Ġde scriptor
no inline
An y
uff ix
9 3
ab c
TE GER
Ġs um
M ac
ĠT race
Valid ator
Ġcount ry
Key Spec
Ġm Rec
Ġm Next
ĠJ D
ĠPer mission
k ens
C LI
Compat ible
Add r
SP ON
SS ID
ĠAU DIO
ĠC Log
L ines
qui val
O VER
Update d
ot her
ent s
G en
Ġon Re
ĠI tem
Ġd ot
Ġen tity
Sc ope
Sc anner
ĠImage View
g ithub
Ġaccess ibility
Shell Command
Ġstart Time
SE S
ĠSc ript
Ġpa int
Ġm Event
Ġal ias
ĠCh rono
r eturn
Rat io
Ġs un
j avaparser
Ġiden tity
D one
Ac tual
Ġm Start
Ġalloc ate
fl ow
ĠDate Format
ĠArgument s
Ġrecyc le
N ullable
Ġm Target
Ġm Text
Ġm Default
Ġf lag
Ġobtain Message
u x
l ural
Ġu sage
Ġm Config
tp Server
s For
Trans ient
Ġget G
Ġm PackageManager
F T
um bn
umbn ail
T ON
b ine
t ax
ĠS AX
A ES
Ġget Window
Con sumer
OW ER
ĠC RE
Ġ Q
ĠSY STEM
Ġstart Activity
Ġpre pare
ĠComp let
File Name
ĠPER MISSION
B ig
ON LY
Ġm Active
FAIL URE
h ost
Second s
g en
ME THOD
con fig
Ġvis ible
SE LE
ĠSh ared
NotAvailable Exception
Ġlog Writer
Ġpri mary
Sec tion
Ġm Num
Mem ory
ti m
Ġpro p
ĠSequence Component
Ġget Calling
Sp i
ĠI p
Ġex c
Ġcreate From
ASS WORD
ĠImmutable Map
ac ade
U TE
LE TE
CHANG E
la sh
Inter polator
9 1
Ġc e
Down load
i se
ĠgetIn strumentation
O RE
Ġparse Int
at ile
PRO FILE
ann able
Ġchar set
ryp ted
Ġj f
Gener ic
ar mon
Ġdirec tory
ĠFI ELD
ĠF eature
Ġlog ging
ack ed
ĠC ache
ĠP ower
oice mail
_ _
eb View
Ġte lecom
ĠRuntime Environment
Ġc ipher
ra ms
ĠG ONE
Ġlang uage
s d
B AR
2 24
s ume
ast er
Count ry
Pro duc
Struc ture
ĠDevice NotAvailableException
er v
ake Lock
armon y
/ "
P ublic
P kg
Ġcon dition
PRE FIX
Ġis Null
Set ter
L U
ag er
ool bar
Create d
M anaged
Ġl ifecycle
Ġbind ing
De pth
ĠRS RuntimeException
Ġs QL
f ul
r un
Met ric
Ġmove To
Ġp adding
sc ape
lu ster
Dis c
Ġset Title
M ove
ĠgetS imple
Ġin flater
Text Bundle
NO TIFICATION
ra d
ĠDate Time
Enum s
d irec
ST ALL
Shortcut s
B ILITY
re f
re port
os ition
ĠMedia Format
At om
Ġm Status
Ġexpect Equals
Ġp lay
Ġinvalid ate
Un expected
M argin
S W
ĠC ert
i i
u ted
de vice
ĠG et
ĠF uture
al lable
eg in
Ġinc rement
Ġc ustom
r ant
ĠInter nal
UP DATE
PH ONE
C a
12 3
ersist able
Ġp h
ĠX ML
Ap n
ĠMethod Handle
Node s
Pro visioning
In formation
op t
Ind icator
uff ers
Ap k
SE C
R T
for med
Ġ{ "
it ude
ĠDevice PolicyManager
I me
H igh
L ower
vers ion
Ġ2 55
os ite
Ġl oader
F ACE
Ġget Package
Ġdisplay Id
p u
Ġm Ui
PK G
pe at
Ġk ind
SH IFT
Ġcon stant
IG N
Ġpre view
Ġob server
Ġne ed
Ġ ~
Ġraw ContactId
Ġrecei ver
Ste p
ĠDescri ptor
SETTING S
Ġtest Run
Field Element
S napshot
m an
Ġcall er
RO M
T ra
Ġ" --
i ed
ateg y
OFF SET
D U
I CE
T ermin
Dis miss
ĠUnicode Set
I ter
Ġinput method
De buggee
ĠC ustom
Ġfile Name
O G
Layout Params
t l
Ġsend Reply
Ġe ap
LO CAL
Multi ple
ĠT ask
Key board
C losed
ĠApp OpsManager
VALUE S
s id
rol ler
ĠPhone Number
lab ility
Frame s
Ġse q
F ill
x ml
Ġc ldr
Ġget Intent
ĠmMock Device
Ġb y
ĠIN STANCE
ĠRobolectric TestRunner
ĠL abel
ĠsetOn ClickListener
Det ector
Ġwh ich
Ġsc roll
I X
s ize
Ġp oll
ĠChar set
ĠTest Utils
P rinter
Un lock
Ġfeature s
Algorithm Exception
CATE GORY
F older
Ġs f
ĠResol veInfo
imp ort
Ġget N
Ġcon n
O rientation
il er
Suggestion s
Ġo wner
ate s
RO W
Ġstatus bar
Ġcheck Argument
Ġd im
Ġw m
Ġa bs
FA ILED
T ASK
Ġitem s
Ġget Property
Ġm ask
s ic
> \
b y
Ġv olume
ER A
Pro jection
De x
M T
ĠS UB
ob ile
ĠFile OutputStream
For User
ĠKey Store
ph em
Ġexist s
Ġextension Registry
ĠB U
v r
U tf
En ded
ĠNotification Manager
s a
ĠLe vel
ĠJD WP
et a
CE I
b ind
Failed Exception
Ġm Channel
Enc ryption
Ġ12 8
ĠParcel FileDescriptor
ĠD ER
Ġp eek
Ġ"/ "
ice s
ĠL ifecycle
BU FFER
ĠgetSimple Name
Ġname s
H ttp
in dex
ĠC AP
o us
P ublicKey
s l
Ġ" \"
UM ENT
D b
Ġp id
Ġp ending
Ġro und
ĠF actory
A ware
Ġ Res
SP ACE
Ġ[ "
Ġm Resolver
ĠL ock
Ġrec t
Ġmulti map
ME DI
Ġcal c
ĠGwt Incompatible
con nected
Att ach
Dig its
ec ond
ĠH as
CONNE CT
Delay ed
Ġcon structor
Record s
A w
Ġa utofill
Ġh armony
Se gment
ĠAnim ation
med i
Al g
ĠFOL LOW
Sa ver
Ġchar acter
ĠSubscription Manager
ĠLine arLayout
P riv
uc ce
Run time
ĠNoSuch AlgorithmException
Ġm Icon
Ġs ax
V erify
rup t
I TIAL
Ġ2 3
Inc orrect
C US
in stall
C D
Class Loader
ĠWifi Manager
Ġbenchmark s
or s
VE L
iom etric
ĠMet ric
Ġget Field
l ator
al y
Ġget Extension
Ġun icode
Ġh igh
Ġad ap
ĠT H
VI SION
PER TY
Ġreturn ed
ĠCON NE
T imer
l ate
us pend
Multi set
R S
ĠP o
St amp
MP ORT
STR U
ĠS witch
ic ro
AC COUNT
URRE NT
Ġl oc
SH OW
Ġdig est
GR OUP
ist ic
Ġparse From
R ST
FER ENCE
KE T
H our
am ing
RI GHT
rin sic
CONT ACT
Ġm ac
il ing
Ġmax TargetSdk
Ġret val
x a
ĠH T
ĠS orted
v is
Char s
Feature Provider
Ġtrack ing
Ġcalling Uid
ĠDialog Interface
I AL
ĠME THOD
ĠCOMM AND
Th is
ol og
Com ment
Ġm Connection
d f
OL D
Ġhead ers
p m
Ad just
String s
ens us
ĠC ore
ĠU Character
S in
T ile
UT F
e et
WID TH
a N
ĠFile InputStream
P ARE
ĠD ownload
iz ard
Ġr adio
cont ent
C P
ĠSE CONDS
com ing
il y
B ucket
SPON SE
ĠB ind
ersistable Bundle
Ġt ab
Ġc ounter
iction ary
LI C
l ight
Ġch unk
Ġse ek
riv er
F ULL
UT TON
Ġdec oder
For ward
O ther
T ABLE
Ġin te
l ink
Ġresol ver
C ENT
N G
Ġ10 24
Measure Spec
ug h
G EST
COL OR
enc ies
Ġnan o
Ġb its
Ġst orage
AS H
Ġcont acts
ĠTIME OUT
Ġl at
Mock s
Ġm essaging
ĠmS urface
ari es
D ynamic
FO CUS
70 7
Ġ" )
ĠSec P
SUP PORTED
Ġ' \
Log ging
ĠF IL
ir c
MAN AG
Ġw ord
Ġh ide
ĠEN D
bo se
Return Value
ĠAT TR
38 4
ron t
ĠmD is
ĠMedia Codec
rid ge
ĠCO DE
requ ency
ĠS lice
Ed itor
n d
lephony Manager
Ġon Start
OU BLE
ĠBluetooth Profile
ĠXmlPullParser Exception
Map ping
Ġ" @
ĠS TR
Buffer Exception
ĠF AIL
Ġprog ress
X Y
Ġc losed
Ġro ute
stric ted
ar ing
ĠN ONE
Key Store
55 3
ĠRE QUEST
Ġm Image
p ass
Ġm Id
P id
ĠgetDec lared
Ġm Name
AU TH
T rigger
With out
Ġbound s
Node Info
Ġdis able
V ED
ĠStatus Bar
< /
Ġadd r
an e
ĠA uth
S imple
ĠP ri
Ġin sn
Contain s
ĠM atcher
Comp arator
A MP
Dec ode
ari ant
ĠH OUR
Convert er
ition al
ĠUser Info
F tpServer
Ġb s
Ġm UserId
ĠI P
Socket Factory
ĠLinked List
ĠM on
NE W
I A
Ġc ategory
p r
D omain
Ġp i
ĠIn ject
S ymbols
IN PUT
Ġshort cut
Ġvol atile
x e
er ic
AR RI
ĠcreateS ized
AR RAY
DE FIN
vai lability
Ġset Data
C b
D rag
ĠH el
Ġp acket
Ġ5 00
ip ient
Ġlog ln
User s
Key Exception
Ġ Storage
Ġb ut
CR Y
Ġget View
P LY
Ġb inary
Ġutil s
Ġ1 7
ĠM ore
IN VALID
Ġper iod
MAT CH
r ate
00000000 00000000
i tem
Ġrequire NonNull
U LE
ĠAL LOW
ogn ition
SI BILITY
Ġf tp
Direc t
V IDEO
Ġuser Handle
FO RE
Ġp oint
ĠS ample
Sh own
Ġrun On
Ġint Value
ĠJava File
A K
Array Equals
Ġhe x
Un signed
ĠW eak
ĠAssertion Error
Se parator
Ġ2 1
ARRI ER
ĠV ector
Pop up
Ġm atrix
L at
ĠR adio
ĠO pen
ĠG ET
ĠCol lation
ĠN ULL
rivate Key
ĠAl ertDialog
Ar chive
ĠmS p
Task s
Ġm Settings
ĠS ource
DI AL
IL D
Present ation
Pixel s
jec ted
C annot
Ġget Selected
Expand ed
ĠArgument Matchers
Ġset Default
An swer
ĠgetA bsolute
U pper
ĠM odule
RE ST
C lean
Ġ QU
Ġm Sc
Float Float
Ġ", "
HE ADER
Com mon
d is
Ġst ore
An chor
ĠN ot
ether ing
COL UMN
olog y
Ġm easure
Con versation
ĠCO MP
M Y
b ound
Resource Bundle
ĠRef lection
A UTO
Ġm imeType
Dispatch er
OL U
Ġget File
L oaded
Ġfil ename
LE MENT
Ġvis itor
b it
is match
Base d
Ġcommon s
Ġchannel z
UN CH
Ui Thread
For ce
Ġrule s
ADD RESS
Ġon Resume
b d
ĠB l
F acade
Ġc alled
Ġs ummary
( "
Ġany String
Ġenc oding
EN S
ĠW ork
x D
Ġtracking Bug
TR Y
w idth
medi ate
Ġ" +
ang es
ssu er
x F
eth row
ĠAC COUNT
ĠP red
ĠF oo
RE D
m ax
AC H
Re peated
Or Builder
al th
ch em
COMP ONENT
Ġm Manager
Ġget Active
Ġs ingleton
Ġget R
ĠContacts Contract
IN D
ĠV ehicle
Ġb ar
ĠPackage Info
I mmutable
ĠS P
ĠB asic
Ass oci
Render Script
G E
R C
ĠList s
Ġupdate State
FOR M
D K
er ent
Pro viders
ĠParse Exception
p ect
Ġ Listener
Enc od
Ġmulti ply
CL U
Ġc andidate
pe x
Ġrep lay
Ġ2 5
RI TE
Ġp latform
Ref resh
Builder Factory
U sed
d o
ĠA utofill
Ġ \"
Dig it
ĠM AN
mb ient
rig inal
F RE
CO MM
Ġt ree
AT S
Ġc ertificate
H idden
Ġm Intent
Ġ ec
n ss
pri se
ĠGenerated Message
Ġc ookie
Ac cept
P icture
W ri
ĠDe x
N ING
en e
w h
U pd
er ation
D istance
S peed
Ġc annot
Version UID
Ġget I
de fault
Ġcontent s
ĠL AY
or ing
Ġpro tocol
ĠWifi P
Ġs im
ĠmActivity Rule
tifi ers
SE COND
t ag
ITE M
Prev ious
Ġi ke
not ated
C RL
D imension
Ġp eer
Ġin putStream
Ġ6 4
SPE C
ĠVAL UE
u icc
B g
ation al
Ġ Expression
Exception s
Ġchannel s
Ġsh utdown
EE K
all ery
ĠSp literator
Ġinvocation Record
ĠT E
Character istics
ĠC reator
ĠMenu Item
Ġm Call
ĠL E
All ow
it able
TI VITY
Ġs quare
ac er
Ġ69 54
Test Utils
Ġassert ArrayEquals
ĠFile NotFoundException
S QL
Ġin ner
Un til
Ġy aml
Ġhandle Command
F actor
ATI C
r r
Ġapplication Info
ĠwriteTo Parcel
T A
Ġat om
an ss
Ġdb g
Hex String
Ġopen c
du ce
ĠgetApplication Context
Ġb ranch
ĠU P
D O
ĠD uration
LO CATION
me ss
ON T
Nan o
Ġm an
f s
Ġs ame
Con ference
M IT
N ormal
For m
Ġs n
Ġ1 8
Ġpro jection
ĠInput Method
A utofill
L oop
ĠS ip
ĠO s
To Double
ra sh
Ġis S
ail s
Ġopenc ensus
ĠNotification Channel
S cheme
ed ium
Key guard
ĠmL ayout
ac tive
Ġm Scroll
L ow
for mat
B oot
C M
Ġr ethrow
to ken
ww w
Ġt wo
Ġ2 8
n et
Ġset Color
ĠGener al
ĠIN TEGER
LU ET
Ġsupport s
OO TH
LUET OOTH
D ial
Ġset C
CH ANNEL
am ily
ĠI con
ur bine
ĠS U
ver ti
LE VEL
Ġcar rier
ĠAU TH
M anifest
a e
ic ip
x C
Ġc s
Ġc ached
ĠS C
ang le
Ġauth ority
up lic
Exp ect
Str ategy
Half Half
Ġl ower
ign ment
I OException
v i
Ġdefault Value
S ymbol
Notification s
Ġ69 5
Build Info
al ed
Iden tifiers
Le g
ĠIC U
No tify
SI TIVE
Dec or
Trans lation
ĠSH ORT
d ate
e an
Ġb attery
pro cess
Ġc ard
Ġserial VersionUID
Ġexist ing
Re lease
ST ANT
* "
ĠsetContent View
x E
Ġa g
Ġct x
ĠAL L
RE CEI
Ġcontent Type
ĠFile Util
s ystem
IG H
In ner
Ġ" #
E lapsed
c d
Re store
Ġ" }"
Ġw allpaper
ĠZ en
U int
Pre par
FR AME
ĠFOR MAT
B ot
Ġd one
T M
Ġchar s
F il
Number Of
UL TI
Exp onent
o om
re ens
Ġnext Int
Ġde pth
sc an
PRO VIDER
ĠInstruction Constants
Ġs ymbols
Ġm De
Ġpro perties
SI M
T S
ĠITest Device
Ġm illis
C ould
ROL L
n ew
Supp lier
ĠPred icate
L auncher
W INDOW
Ġm Package
ĠO NE
an ts
ĠAssert FailedException
Ġd own
CRE ATE
Def inition
Ġ Execution
SU CCESS
ĠSe lection
ĠParam eters
Ġis Checked
ĠU ID
ĠCol lector
ĠUn known
AD ATA
Ġb ig
scri pt
Ġrequest ed
Ġm Result
Ġad just
5 12
Ġm Selected
ĠR IL
LI CY
mess age
L java
Activ ities
W H
Pre ferred
Account s
J oin
Ġte mplate
Ġget Color
er nel
Ġp rinter
Ġ> >
M ix
T ip
chem a
L ifecycle
ĠFile s
Ġs lice
Ġcon nected
ĠGwt Compatible
Ġd id
ACTI VE
? "
Ġvalue At
AB EL
Re maining
AR CH
Ġi m
Par tial
ĠTrans form
FIL TER
ENT ATION
Ġb ucket
Ro le
t c
B reak
um b
P hoto
T yped
C rypto
Ġname space
Ġm Screen
ist og
pe g
sc ii
Ġback ground
BO SE
gn ored
Ġm Type
S w
Ġc ould
ĠCon sumer
Network s
ĠAd apter
Ġpart s
ĠDOM Test
et ime
ĠClass Loader
oo se
By Name
Ġs ensor
ĠBluetooth Adapter
al le
TI TLE
ĠG ravity
Path s
ĠNumberFormat Exception
erv let
Data Set
Ġa i
ch ecked
lus ive
M issing
ĠP ass
R adius
Class And
Man age
ĠGeneratedMessage V
AR I
el et
ys ical
Ġf ocus
Ġin jector
Ġhel per
c um
State ment
D ist
Ġb b
Ġo verride
Ġj ar
N avigation
S chedule
V P
h and
le vel
11 11
c all
ĠList en
x B
ĠmRe mote
J son
ĠD H
Le ast
INT ENT
f rame
Ġr pc
Encod able
ARG ET
mit ted
PRO VISION
ĠgetD imension
g able
s In
CE S
S OURCE
ĠRequire s
un used
ĠgetAbsolute Path
Ġcheck ed
Ġ2 9
ĠDec imal
c m
Ġ12 3
Z en
Ġar r
Ġres Id
Device Info
et rics
Ġ' "
c n
re q
Ġ10 1
P tr
x x
In strumentation
ro ke
Syn tax
ĠIndex OutOfBoundsException
ul ation
Socket Address
Ġcomp arator
ĠG R
Ignore Case
OR DER
Autom ation
Re laxed
ĠN E
ĠInt Def
Ġc r
DEFIN ED
P rincipal
Ġin teger
ĠZ ERO
Ġext ract
ClassAnd Number
F raction
Ġex it
istog ram
c ts
Ġexecute ShellCommand
Ġfrom ClassAndNumber
R ing
Ġget Un
GR ANT
ALLOW ED
vok ed
ar able
Byte Buffer
Un able
C BC
alle l
ff ic
ĠNO TIFICATION
ĠM atch
Ġon ly
Show ing
Mem ber
ĠInvalid KeyException
Dialog Fragment
ĠW INDOW
1234 5678
Ġchild ren
stat ic
D OM
Ġm Preview
Ġg en
Ġassert With
P ersist
V erification
I ke
l one
Ġelapsed Realtime
st im
ĠParameter ized
ĠCL ASS
ĠProg ram
Ġg ot
Ġh our
Filter s
Ġ oid
oll back
ĠS im
oo d
CONNE CTION
a j
x is
s afe
Second ary
FIN ITY
h cp
Ġdis miss
ĠN avigable
Ġadd Action
Leg acy
Ġm PackageName
In voke
ĠCont rol
DIS ABLED
ĠComplet ableFuture
S M
byte s
Ġa m
lo or
Ġun modifiable
Ġtype Solver
Rep lace
B ASE
ĠmContent Resolver
D ot
Service Info
TERN AL
Ġanim ator
J ar
Ġprint StackTrace
Exec utable
Warn ing
ot a
Mod ified
o pped
Ġis NotNull
Ġmet a
ĠencodePer Unaligned
go ing
ĠG roup
ĠRec yclerView
ĠencodePer Aligned
ĠO FF
Ġclass file
ĠAccessibility NodeInfo
ĠGener ic
Channel s
Conf irm
Ġc enter
ĠM IME
on ed
la in
ĠmTe mp
B l
agn ost
Ġver ifier
S ent
l ocal
Ġh al
Date Format
Ġget Status
Ġre q
ĠgetS ource
IFI ED
Explicit ly
ĠInvalid Protocol
g oogle
Ġj d
Ġc alendar
g ra
Ġcomp ilation
Ġresol ved
Voice mail
Ġcom ment
g ener
Ġfrom Per
Sec ure
ss i
ĠJSON Array
ĠPAR SER
C AST
Ġc f
AA A
Ġcur ve
Ġunknown Fields
ĠRE AD
EN DED
ĠmUser Manager
ĠA p
IN K
Format s
Qual ity
Hash Code
I ON
t one
SIGN ED
T ED
Ġdirec tion
Ġs orted
Ġl ines
Ġd ownload
Ġdex lib
Al ert
Ġmethod s
AM ERA
ĠIN T
Head set
ĠCONT ROL
t ract
id l
ĠS IGN
ĠmL ocal
System Server
ĠCRE ATOR
ĠCommand Handler
ce ptor
D ataset
il ver
f irm
Ġset Field
ĠT ABLE
tt en
tec tion
ab ilities
sc rypt
ĠData base
Sh ader
ĠTrans ition
Ġ Response
S kip
ex ample
ĠSY S
29 553
Row s
B LOCK
oo ser
Ġresult Code
Ġanim ate
Ġon Changed
Ġre ps
Ġ1 707
ĠInvocation Record
Ġd t
Sub Id
ĠgetC ause
Ġget Network
Trans formation
Ġ1707 29553
ĠH E
ĠCON FIG
Ġaccount s
G ran
ĠElement Type
Ġempty List
Ġpa ir
ĠN at
comp onent
Ġre quired
im age
FFFF FFFF
T otal
ĠmM in
Ġtrans action
ĠLocal Date
Ġ12 34
st ate
Ġ" =
Ġb roadcast
ĠIN DEX
N A
ĠP H
Ġ Static
Ġcheck er
chron izer
EN TI
Ġc lick
ĠF ail
Restric tion
Uri s
Ġget Encoded
DIRE CT
F i
Ġv ariable
Ġadd View
Ġp layer
Ġfor Class
ĠOut put
Ġal ready
PORT S
IN FINITY
H i
Sdk Version
U AL
Ġget Drawable
Component s
Ġcount Down
ĠonRe ceive
Ġ ans
C ANCE
Ġget Error
Extension s
Ġt ool
ĠF ast
Ġp age
_ "
ST REAM
C A
Ġo peration
ug e
ĠScan Result
List View
Ġm Request
Ġremove All
ĠCon structor
sh eet
ĠmS ystem
SES SION
sh ow
Ġn s
Ġexp and
OLU ME
ĠInvalidProtocol BufferException
IT CH
Ġget App
y y
ĠPK CS
Z ip
Match es
Ġm Native
Ġm Parent
ur ing
ec tion
Ġass ume
Col lector
Report er
Ġftp Client
R out
Ġ( "
In stant
ers on
ross Profile
Pred icate
Ġout er
Ġ Expected
ĠC MD
ĠmL ooper
ĠgetChild At
P latform
Ġrecei ved
ĠP art
Ret ry
b utton
Ġnew ArrayList
Ġput All
Index able
ĠmTe lephonyManager
Ġadap tor
P I
Key Set
M ONTH
rad ient
Ġw earable
reens hot
ĠP ersistableBundle
r u
or ded
ĠBuffered Reader
urs ive
ĠSp annable
Ġ" ."
Ġget Object
Ġon Destroy
ĠVER BOSE
Interaction s
Sin ce
s ence
greg ation
D N
Private Key
ĠCapture Request
C reation
Ġset Checked
C enter
t xt
Ġo pcode
ret Key
Upd ater
L AS
Ġset Visible
Int Array
Ġ3 6
Ġo pcodes
Ġ& =
If Needed
IM AGE
ĠV ariable
DI R
B inary
S cheduler
ĠTest Description
ĠPower Manager
ĠR O
S uper
ĠM ED
ĠSettings Enums
W atcher
LI CATION
ĠMeasure Spec
B egin
d og
Input Method
ĠgetM in
White list
ĠPar ser
ĠY EAR
LI MIT
ĠPK G
Ġc a
Ġatt ach
ĠSAX Exception
Ġget Log
ĠA dd
OR AGE
Ġequals IgnoreCase
end ers
Mode s
Object Identifiers
Ġcomp lete
Ġformat ter
b c
Ġf ix
